In [20]:
#import nessecray libraries
import sqlalchemy
from sqlalchemy import create_engine
import sqlite3
from sqlite3 import Error
import pandas as pd

In [21]:
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

 
def select_all_tasks(conn):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
    query1 = """
        SELECT *
        FROM FACILITIES
        """
    cur.execute(query1)
 
    rows = cur.fetchall()
 
    for row in rows:
        print(row)


def main():
    database = "sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("2. Query all tasks")
        select_all_tasks(conn)
 
if __name__ == '__main__':
    main()

2.6.0
2. Query all tasks
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)
(7, 'Snooker Table', 0, 5, 450, 15)
(8, 'Pool Table', 0, 5, 400, 15)

# Visualizing SQL Data

The data you need is in the "country_club" database. This databasecontains 3 tables:(
    i) the "Bookings" table,
    ii) the "Facilities" table, and
    iii) the "Members" table.)

#Query database BOOKINGS (ATTEMPT 1 **functional but long and has no indexing)


#def main():
    #database = "sqlite_db_pythonsqlite.db"

    #conn = create_connection(database)
    #with conn: 
        #rs=conn.execute("SELECt* FROM BOOKINGS")
        #print(rs)
        #select_all_tasks(conn)
    #df=pd.DataFrame(rs.fetchall())
    
    #return (df)

#main()

In [45]:
sql_query0 = "SELECT name FROM sqlite_master;"

df0 = pd.read_sql_query(sql_query0, connection)
print(df0)

                            name
0                       Bookings
1    sqlite_autoindex_Bookings_1
2                     Facilities
3  sqlite_autoindex_Facilities_1
4                        Members
5     sqlite_autoindex_Members_1

In [22]:
#Query database BOOKINGS ATTEMPT 2
#step 1: connection 
database = "sqlite_db_pythonsqlite.db"
connection = sqlite3.connect(database)

# Step 2: Define the SQL query
sql_query = "SELECT * FROM bookings;"

# Step 3: Read data into a DataFrame and set a column as the index
df_bk = pd.read_sql_query(sql_query, connection)

In [23]:
print(df_bk)

      bookid  facid  memid            starttime  slots
0          0      3      1  2012-07-03 11:00:00      2
1          1      4      1  2012-07-03 08:00:00      2
2          2      6      0  2012-07-03 18:00:00      2
3          3      7      1  2012-07-03 19:00:00      2
4          4      8      1  2012-07-03 10:00:00      1
...      ...    ...    ...                  ...    ...
4038    4038      8     29  2012-09-30 16:30:00      2
4039    4039      8     29  2012-09-30 18:00:00      1
4040    4040      8     21  2012-09-30 18:30:00      1
4041    4041      8     16  2012-09-30 19:00:00      1
4042    4042      8     29  2012-09-30 19:30:00      1

[4043 rows x 5 columns]

In [24]:
#Query database FACILITIES
#step 1: connection 
database = "sqlite_db_pythonsqlite.db"
connection = sqlite3.connect(database)

# Step 2: Define the SQL query
sql_query = "SELECT * FROM FACILITIES;"

# Step 3: Read data into a DataFrame and set a column as the index
df_fac = pd.read_sql_query(sql_query, connection)

In [25]:
print (df_fac)
df_fac.shape

   facid             name  membercost  guestcost  initialoutlay  \
0      0   Tennis Court 1         5.0       25.0          10000
1      1   Tennis Court 2         5.0       25.0           8000
2      2  Badminton Court         0.0       15.5           4000
3      3     Table Tennis         0.0        5.0            320
4      4   Massage Room 1         9.9       80.0           4000
5      5   Massage Room 2         9.9       80.0           4000
6      6     Squash Court         3.5       17.5           5000
7      7    Snooker Table         0.0        5.0            450
8      8       Pool Table         0.0        5.0            400

   monthlymaintenance
0                 200
1                 200
2                  50
3                  10
4                3000
5                3000
6                  80
7                  15
8                  15

(9, 6)

In [26]:
#Query database Members
#step 1: connection 
database = "sqlite_db_pythonsqlite.db"
connection = sqlite3.connect(database)

# Step 2: Define the SQL query
sql_query = "SELECT * FROM Members;"

# Step 3: Read data into a DataFrame and set a column as the index
df_mem = pd.read_sql_query(sql_query, connection)

In [27]:
print (df_mem)

    memid            surname  firstname  \
0       0              GUEST      GUEST
1       1              Smith     Darren
2       2              Smith      Tracy
3       3             Rownam        Tim
4       4           Joplette     Janice
5       5            Butters     Gerald
6       6              Tracy     Burton
7       7               Dare      Nancy
8       8             Boothe        Tim
9       9           Stibbons     Ponder
10     10               Owen    Charles
11     11              Jones      David
12     12              Baker       Anne
13     13            Farrell     Jemima
14     14              Smith       Jack
15     15              Bader   Florence
16     16              Baker    Timothy
17     17             Pinker      David
18     20            Genting    Matthew
19     21          Mackenzie       Anna
20     22             Coplin       Joan
21     24             Sarwin  Ramnaresh
22     26              Jones    Douglas
23     27             Rumney  Henrietta
24     28            Farrell      David
25     29  Worthington-Smyth      Henry
26     30            Purview  Millicent
27     33         Tupperware   Hyacinth
28     35               Hunt       John
29     36            Crumpet      Erica
30     37              Smith     Darren

                                    address  zipcode       telephone  \
0                                     GUEST        0  (000) 000-0000
1                8 Bloomsbury Close, Boston     4321    555-555-5555
2              8 Bloomsbury Close, New York     4321    555-555-5555
3                    23 Highway Way, Boston    23423  (844) 693-0723
4                20 Crossing Road, New York      234  (833) 942-4710
5            1065 Huntingdon Avenue, Boston    56754  (844) 078-4130
6                   3 Tunisia Drive, Boston    45678  (822) 354-9973
7               6 Hunting Lodge Way, Boston    10383  (833) 776-4001
8        3 Bloomsbury Close, Reading, 00234      234  (811) 433-2547
9                 5 Dragons Way, Winchester    87630  (833) 160-3900
10     52 Cheshire Grove, Winchester, 28563    28563  (855) 542-5251
11                 976 Gnats Close, Reading    33862  (844) 536-8036
12                55 Powdery Street, Boston    80743    844-076-5141
13          103 Firth Avenue, North Reading    57392  (855) 016-0163
14               252 Binkington Way, Boston    69302  (822) 163-3254
15               264 Ursula Drive, Westford    84923  (833) 499-3527
16                329 James Street, Reading    58393    833-941-0824
17                   5 Impreza Road, Boston    65332    811 409-6734
18    4 Nunnington Place, Wingfield, Boston    52365  (811) 972-1377
19              64 Perkington Lane, Reading    64577  (822) 661-2898
20      85 Bard Street, Bloomington, Boston    43533  (822) 499-2232
21               12 Bullington Lane, Boston    65464  (822) 413-1470
22                 976 Gnats Close, Reading    11986    844 536-8036
23               3 Burkington Plaza, Boston    78533  (822) 989-8876
24          437 Granite Farm Road, Westford    43532  (855) 755-9876
25              55 Jagbi Way, North Reading    97676  (855) 894-3758
26   641 Drudgery Close, Burnington, Boston    34232  (855) 941-9786
27  33 Cheerful Plaza, Drake Road, Westford    68666  (822) 665-5327
28                5 Bullington Lane, Boston    54333  (899) 720-6978
29              Crimson Road, North Reading    75655  (811) 732-4816
30           3 Funktown, Denzington, Boston    66796  (822) 577-3541

   recommendedby             joindate
0                 2012-07-01 00:00:00
1                 2012-07-02 12:02:05
2                 2012-07-02 12:08:23
3                 2012-07-03 09:32:15
4              1  2012-07-03 10:25:05
5              1  2012-07-09 10:44:09
6                 2012-07-15 08:52:55
7              4  2012-07-25 08:59:12
8              3  2012-07-25 16:02:35
9              6  2012-07-25 17:09:05
10             1  2012-08-03 19:42:37
11             4  2012-08-06 16:32:55
12             9  2012-08-10 14:23:22
13                2012-08-10 14:28:01
14             1  2012-08-10 16:22:05
15             9  2012-08-10 17:52:03
16            13  2012-08-15 10:34:25
17            13  2012-08-16 11:32:47
18             5  2012-08-19 14:55:55
19             1  2012-08-26 09:32:05
20            16  2012-08-29 08:32:41
21            15  2012-09-01 08:44:42
22            11  2012-09-02 18:43:05
23            20  2012-09-05 08:42:35
24                2012-09-15 08:22:05
25             2  2012-09-17 12:27:15
26             2  2012-09-18 19:04:01
27                2012-09-18 19:32:05
28            30  2012-09-19 11:32:45
29             2  2012-09-22 08:36:38
30                2012-09-26 18:08:45

In [28]:
import sqlite3
import pandas as pd

# QUESTIONS

In [29]:
#Q1: Some of the facilities charge a fee to members, but some do not.
#Write a SQL query to produce a list of the names of the facilities that do.

sql_query1= "SELECT name FROM FACILITIES WHERE guestcost >0; "
df1= pd.read_sql_query(sql_query1, connection)
print (df1)

              name
0   Tennis Court 1
1   Tennis Court 2
2  Badminton Court
3     Table Tennis
4   Massage Room 1
5   Massage Room 2
6     Squash Court
7    Snooker Table
8       Pool Table

In [30]:
#Q2: How many facilities do not charge a fee to members? */

sql_query2= "SELECT COUNT(name) FROM FACILITIES WHERE guestcost <=0; "
df2= pd.read_sql_query(sql_query2, connection)
print (df2)

   COUNT(name)
0            0

In [31]:
# Q3: Write an SQL query to show a list of facilities that charge a fee to members, where the fee is less than 20% of the
#facility's monthly maintenance cost. Return the facid, facility name, member cost, and monthly maintenance of the facilities 
#in question. 


sql_query3= "SELECT facid, name,membercost,monthlymaintenance FROM FACILITIES WHERE membercost <0.20*monthlymaintenance ; "
df3= pd.read_sql_query(sql_query3, connection)
print (df3)

   facid             name  membercost  monthlymaintenance
0      0   Tennis Court 1         5.0                 200
1      1   Tennis Court 2         5.0                 200
2      2  Badminton Court         0.0                  50
3      3     Table Tennis         0.0                  10
4      4   Massage Room 1         9.9                3000
5      5   Massage Room 2         9.9                3000
6      6     Squash Court         3.5                  80
7      7    Snooker Table         0.0                  15
8      8       Pool Table         0.0                  15

In [32]:
#Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
#Try writing the query without using the OR operator.

sql_query4= "SELECT * FROM FACILITIES WHERE facid in (1,5) ; "
df4= pd.read_sql_query(sql_query4, connection)
print (df4)

   facid            name  membercost  guestcost  initialoutlay  \
0      1  Tennis Court 2         5.0         25           8000
1      5  Massage Room 2         9.9         80           4000

   monthlymaintenance
0                 200
1                3000

In [33]:
# Q5: Produce a list of facilities, with each labelled as
#'cheap' or 'expensive', depending on if their monthly maintenance cost is
#more than $100. Return the name and monthly maintenance of the facilitiesin question. 

sql_query5= '''
SELECT name, monthlymaintenance,
CASE WHEN monthlymaintenance <=100
THEN 'cheap'
ELSE 'expensive'
END AS affordability
FROM `Facilities`;
'''


df5= pd.read_sql_query(sql_query5, connection)
print (df5)

              name  monthlymaintenance affordability
0   Tennis Court 1                 200     expensive
1   Tennis Court 2                 200     expensive
2  Badminton Court                  50         cheap
3     Table Tennis                  10         cheap
4   Massage Room 1                3000     expensive
5   Massage Room 2                3000     expensive
6     Squash Court                  80         cheap
7    Snooker Table                  15         cheap
8       Pool Table                  15         cheap

In [34]:
#Q6: You'd like to get the first and last name of the last member(s) who signed up. 
#Try not to use the LIMIT clause for your solution. 

sql_query6 ='''
SELECT surname, firstname 
FROM 'Members'
WHERE joindate =(
SELECT MAX(joindate)
FROM 'Members') 
'''
df6= pd.read_sql_query (sql_query6, connection)
print(df6)

  surname firstname
0   Smith    Darren

In [35]:
#Q7: Produce a list of all members who have used a tennis court.Include in your output the name of the court, 
#and the name of the member formatted as a single column. Ensure no duplicate data, and order by the member name.


sql_query7 ='''
SELECT DISTINCT m.firstname ||" "|| m.surname AS full_name, f.name AS facility_name
FROM 'bookings' AS b    
LEFT JOIN `Facilities` AS f ON b.facid = f.facid
LEFT JOIN `Members` AS m ON b.memid = m.memid
WHERE f.name LIKE 'Tennis%'
ORDER BY  full_name
'''
df7= pd.read_sql_query(sql_query7, connection)
print (df7)

            full_name   facility_name
0          Anne Baker  Tennis Court 1
1          Anne Baker  Tennis Court 2
2        Burton Tracy  Tennis Court 2
3        Burton Tracy  Tennis Court 1
4        Charles Owen  Tennis Court 1
5        Charles Owen  Tennis Court 2
6        Darren Smith  Tennis Court 2
7       David Farrell  Tennis Court 1
8       David Farrell  Tennis Court 2
9         David Jones  Tennis Court 2
10        David Jones  Tennis Court 1
11       David Pinker  Tennis Court 1
12      Douglas Jones  Tennis Court 1
13      Erica Crumpet  Tennis Court 1
14     Florence Bader  Tennis Court 2
15     Florence Bader  Tennis Court 1
16        GUEST GUEST  Tennis Court 2
17        GUEST GUEST  Tennis Court 1
18     Gerald Butters  Tennis Court 1
19     Gerald Butters  Tennis Court 2
20   Henrietta Rumney  Tennis Court 2
21         Jack Smith  Tennis Court 1
22         Jack Smith  Tennis Court 2
23    Janice Joplette  Tennis Court 1
24    Janice Joplette  Tennis Court 2
25     Jemima Farrell  Tennis Court 2
26     Jemima Farrell  Tennis Court 1
27        Joan Coplin  Tennis Court 1
28          John Hunt  Tennis Court 1
29          John Hunt  Tennis Court 2
30    Matthew Genting  Tennis Court 1
31  Millicent Purview  Tennis Court 2
32         Nancy Dare  Tennis Court 2
33         Nancy Dare  Tennis Court 1
34    Ponder Stibbons  Tennis Court 2
35    Ponder Stibbons  Tennis Court 1
36   Ramnaresh Sarwin  Tennis Court 2
37   Ramnaresh Sarwin  Tennis Court 1
38         Tim Boothe  Tennis Court 2
39         Tim Boothe  Tennis Court 1
40         Tim Rownam  Tennis Court 2
41         Tim Rownam  Tennis Court 1
42      Timothy Baker  Tennis Court 2
43      Timothy Baker  Tennis Court 1
44        Tracy Smith  Tennis Court 1
45        Tracy Smith  Tennis Court 2

In [36]:
#Q8: Produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30.
#Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the
#guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted
#as a single column, and the cost.Order by descending cost, and do not use any subqueries.

sql_query8 = '''
SELECT DISTINCT m.firstname ||" "|| m.surname AS full_name, f.name AS facility_name,
CASE WHEN b.memid =0
THEN f.guestcost * b.slots
ELSE f.membercost * b.slots
END AS cost

FROM `Bookings` AS b
LEFT JOIN `Facilities` AS f ON b.facid = f.facid
LEFT JOIN `Members` AS m ON b.memid = m.memid
WHERE b.starttime LIKE '2012-09-14%'
AND 30 <
CASE WHEN b.memid =0
THEN f.guestcost * b.slots
ELSE f.membercost * b.slots
END
ORDER BY cost DESC
'''
df8= pd.read_sql_query(sql_query8, connection)
print (df8)

        full_name   facility_name   cost
0     GUEST GUEST  Massage Room 2  320.0
1     GUEST GUEST  Massage Room 1  160.0
2     GUEST GUEST  Tennis Court 2  150.0
3     GUEST GUEST  Tennis Court 1   75.0
4     GUEST GUEST  Tennis Court 2   75.0
5     GUEST GUEST    Squash Court   70.0
6  Jemima Farrell  Massage Room 1   39.6
7     GUEST GUEST    Squash Court   35.0

In [37]:
# Q9: This time, produce the same result as in Q8, but using a subquery. 

sql_query9 = '''
SELECT DISTINCT m.firstname ||" "|| m.surname AS full_name, f.name AS facility_name,
CASE WHEN b.memid =0
THEN f.guestcost * b.slots
ELSE f.membercost * b.slots
END AS cost

FROM `Bookings` AS b
LEFT JOIN `Facilities` AS f ON b.facid = f.facid
LEFT JOIN `Members` AS m ON b.memid = m.memid
WHERE b.starttime LIKE '2012-09-14%' AND b.bookid

IN (SELECT b.bookid
FROM `Bookings` AS b
LEFT JOIN `Facilities` AS f ON b.facid = f.facid
WHERE (b.memid =0 AND f.guestcost * b.slots >30) OR (b.memid >0 AND f.membercost * b.slots >30))

ORDER BY cost DESC
'''
df9= pd.read_sql_query(sql_query8, connection)
print (df9)

        full_name   facility_name   cost
0     GUEST GUEST  Massage Room 2  320.0
1     GUEST GUEST  Massage Room 1  160.0
2     GUEST GUEST  Tennis Court 2  150.0
3     GUEST GUEST  Tennis Court 1   75.0
4     GUEST GUEST  Tennis Court 2   75.0
5     GUEST GUEST    Squash Court   70.0
6  Jemima Farrell  Massage Room 1   39.6
7     GUEST GUEST    Squash Court   35.0

PART 2: SQLite
We now want you to jump over to a local instance of the database on your machine. 

Copy and paste the LocalSQLConnection.py script into an empty Jupyter notebook, and run it. 

Make sure that the SQLFiles folder containing thes files is in your working directory, and
that you haven't changed the name of the .db file from 'sqlite\db\pythonsqlite'.

You should see the output from the initial query 'SELECT * FROM FACILITIES'.

Complete the remaining tasks in the Jupyter interface. If you struggle, feel free to go back
to the PHPMyAdmin interface as and when you need to. 

You'll need to paste your query into value of the 'query1' variable and run the code block again to get an output.

In [47]:
#QUESTIONS:
# Q10: Produce a list of facilities with a total revenue less than 1000. The output of facility name and total revenue, 
#sorted by revenue. Rememberthat there's a different cost for guests and members!

sql_query11='''
SELECT sub.name, SUM(sub.revenue) AS revenue
FROM (
    SELECT b.facid, b.memid, f.name, f.guestcost, f.membercost, COUNT(b.facid) AS facid_count,
    CASE
        WHEN b.memid = 0 THEN COUNT(b.facid) * f.guestcost
        ELSE COUNT(b.facid) * f.membercost
    END AS 'revenue'
    
    FROM Bookings AS b
    LEFT JOIN Facilities AS f ON b.facid = f.facid
    GROUP BY b.facid, b.memid
) AS sub


GROUP BY sub.facid
HAVING revenue <= 1000;

'''
df10= pd.read_sql_query(sql_query10, connection)
print(df10)

SyntaxError: invalid syntax (2981203842.py, line 1)

In [39]:
#Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

sql_query11='''
SELECT m.surname, m.firstname, m.recommendedby AS recomender_id, r.surname AS recomender_surname, r.firstname AS recomender_firstname
FROM Members AS m
LEFT JOIN Members AS r ON m.recommendedby = r.memid
WHERE m.recommendedby != 0
ORDER BY r.surname, r.firstname;
'''
df11 = pd.read_sql_query(sql_query11,connection)
print(df11)

              surname  firstname recomender_id recomender_surname  \
0               GUEST      GUEST                             None
1               Smith     Darren                             None
2               Smith      Tracy                             None
3              Rownam        Tim                             None
4               Tracy     Burton                             None
5             Farrell     Jemima                             None
6             Farrell      David                             None
7          Tupperware   Hyacinth                             None
8               Smith     Darren                             None
9              Sarwin  Ramnaresh            15              Bader
10             Coplin       Joan            16              Baker
11            Genting    Matthew             5            Butters
12              Baker    Timothy            13            Farrell
13             Pinker      David            13            Farrell
14             Rumney  Henrietta            20            Genting
15              Jones    Douglas            11              Jones
16               Dare      Nancy             4           Joplette
17              Jones      David             4           Joplette
18               Hunt       John            30            Purview
19             Boothe        Tim             3             Rownam
20           Joplette     Janice             1              Smith
21            Butters     Gerald             1              Smith
22               Owen    Charles             1              Smith
23              Smith       Jack             1              Smith
24          Mackenzie       Anna             1              Smith
25  Worthington-Smyth      Henry             2              Smith
26            Purview  Millicent             2              Smith
27            Crumpet      Erica             2              Smith
28              Baker       Anne             9           Stibbons
29              Bader   Florence             9           Stibbons
30           Stibbons     Ponder             6              Tracy

   recomender_firstname
0                  None
1                  None
2                  None
3                  None
4                  None
5                  None
6                  None
7                  None
8                  None
9              Florence
10              Timothy
11               Gerald
12               Jemima
13               Jemima
14              Matthew
15                David
16               Janice
17               Janice
18            Millicent
19                  Tim
20               Darren
21               Darren
22               Darren
23               Darren
24               Darren
25                Tracy
26                Tracy
27                Tracy
28               Ponder
29               Ponder
30               Burton

In [40]:
#Q12: Find the facilities with their usage by member, but not guests
sql_query12 = '''
SELECT m.firstname || " " || m.surname AS full_name,
       f.name AS facility_name
FROM `Bookings` AS b
JOIN `Facilities` AS f ON b.facid = f.facid
JOIN `Members` AS m ON b.memid = m.memid
WHERE b.memid <> 0;

'''
df12= pd.read_sql_query(sql_query12, connection)
print (df12)

                    full_name   facility_name
0                Darren Smith    Table Tennis
1                Darren Smith  Massage Room 1
2                Darren Smith   Snooker Table
3                Darren Smith      Pool Table
4                Darren Smith      Pool Table
...                       ...             ...
3155  Henry Worthington-Smyth      Pool Table
3156  Henry Worthington-Smyth      Pool Table
3157           Anna Mackenzie      Pool Table
3158            Timothy Baker      Pool Table
3159  Henry Worthington-Smyth      Pool Table

[3160 rows x 2 columns]

In [41]:
#Q13: Find the facilities usage by month, but not guests

sql_query13 = '''
SELECT m.firstname || " " || m.surname AS full_name,
       f.name AS facility_name,
       strftime('%m', b.starttime) AS usage
FROM `Bookings` AS b 
JOIN `Facilities` AS f ON b.facid = f.facid
JOIN `Members` AS m ON b.memid = m.memid
WHERE b.memid <> 0;


'''
df13= pd.read_sql_query(sql_query13, connection)
print (df13)

                    full_name   facility_name usage
0                Darren Smith    Table Tennis    07
1                Darren Smith  Massage Room 1    07
2                Darren Smith   Snooker Table    07
3                Darren Smith      Pool Table    07
4                Darren Smith      Pool Table    07
...                       ...             ...   ...
3155  Henry Worthington-Smyth      Pool Table    09
3156  Henry Worthington-Smyth      Pool Table    09
3157           Anna Mackenzie      Pool Table    09
3158            Timothy Baker      Pool Table    09
3159  Henry Worthington-Smyth      Pool Table    09

[3160 rows x 3 columns]